Tekla Open API Reference for Tekla Structures 2025
HierarchicDefinition.HierarchyType Property
 The type of the hierarchical definition.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public HierarchicDefinitionTypeEnum HierarchyType { get; set; }
Public Property HierarchyType As HierarchicDefinitionTypeEnum
	Get
	Set
Property Value
Type: HierarchicDefinitionTypeEnum
See Also
Reference
HierarchicDefinition Class
Tekla.Structures.Model Namespace
Tekla.Structures.Model.HierarchicDefinitionTypeEnum